#include "flash.h"

/*******************************************************************************
** 功能	      FLASH初始化
** 参数       无
** 返回值	    无
** 注意       
** 修改日志
*******************************************************************************/
void FLASH_Init(void)
{
    HAL_FLASH_Unlock();
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_ALL_ERRORS);
    HAL_FLASH_Lock();
}

/*******************************************************************************
** 功能	      从Flash读一字节数据
** 参数       add:存储器地址,从0开始
** 返回值	    读出的数据
** 注意       
** 修改日志
*******************************************************************************/
uint8_t FLASH_ReadOneByte(uint32_t add)
{
		return *(__IO uint8_t*)(add);
}


/*******************************************************************************
** 功能	      从Flash读四字节数据
** 参数       add:存储器地址,从0开始
** 返回值	    读出的数据
** 注意       
** 修改日志
*******************************************************************************/
uint32_t FLASH_ReadDword(uint32_t add)
{	
		return *(__IO uint32_t*)(add);
}


/*******************************************************************************
** 功能	      从Flash读取多个数据
** 参数       add:存储器地址,从0开始
              p_rbuf:读取到的数据存放的缓存指针
              nbyte：要读取的数据量，单位：字节
** 返回值	    无
** 注意       
** 修改日志
*******************************************************************************/
void FLASH_ReadnBytes(uint32_t add, uint8_t * p_rbuf, uint32_t nbyte)
{
    //add += FLASH_BASE;//计算Flash实际地址    
    while(nbyte>0)
    {
        *p_rbuf = *(__IO uint8_t*)add;
        add++;
        p_rbuf++;
        nbyte--;
    }
}
